_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 78, 78, 8)         80        
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 39, 39, 8)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 37, 37, 16)        1168      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 18, 18, 16)        0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 18, 18, 16)        64        
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 16, 16, 32)        4640      
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 8, 8, 32)          0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 8, 8, 32)          128       
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 6, 6, 32)          9248      
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 3, 3, 32)          0         
_________________________________________________________________
batch_normalization_3 (Batch (None, 3, 3, 32)          128       
_________________________________________________________________
dropout_1 (Dropout)          (None, 3, 3, 32)          0         
_________________________________________________________________
dense_1 (Dense)              (None, 3, 3, 512)         16896     
_________________________________________________________________
activation_1 (Activation)    (None, 3, 3, 512)         0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 3, 3, 512)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 4608)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 9218      
=================================================================
Total params: 41,570
Trainable params: 41,410
Non-trainable params: 160
_________________________________________________________________
